-- phpMyAdmin SQL Dump
-- version 4.9.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- 생성 시간: 20-04-08 03:13
-- 서버 버전: 10.1.44-MariaDB
-- PHP 버전: 7.0.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `ingsystem_www`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `g5_1_data`
--

CREATE TABLE `g5_1_data` (
  `dta_idx` bigint(20) NOT NULL,
  `com_idx` bigint(20) NOT NULL DEFAULT '0' COMMENT '업체번호',
  `imp_idx` bigint(20) NOT NULL DEFAULT '0' COMMENT 'iMP번호',
  `mms_idx` int(11) NOT NULL COMMENT '설비코드',
  `shf_idx` int(11) NOT NULL,
  `cod_idx` bigint(20) NOT NULL DEFAULT '0' COMMENT '코드번호',
  `dta_shf_no` int(11) NOT NULL COMMENT '교대번호',
  `dta_shf_max` int(11) NOT NULL COMMENT '총교대수',
  `dta_code` varchar(50) NOT NULL,
  `dta_group` varchar(50) DEFAULT '' COMMENT '에러,생산,예시',
  `dta_type` varchar(50) DEFAULT '' COMMENT '전류,전압등',
  `dta_no` int(11) NOT NULL DEFAULT '0' COMMENT '측정번호',
  `dta_name` varchar(60) NOT NULL COMMENT 'ex.모터',
  `dta_dt` datetime DEFAULT '0000-00-00 00:00:00' COMMENT '일시',
  `dta_value` double DEFAULT '0' COMMENT '정수,음수,실수',
  `dta_unit` varchar(20) NOT NULL COMMENT '단위',
  `dta_message` varchar(20) DEFAULT NULL,
  `dta_status` varchar(20) DEFAULT 'pending' COMMENT '상태',
  `dta_reg_dt` datetime DEFAULT '0000-00-00 00:00:00' COMMENT '등록일시',
  `dta_update_dt` datetime DEFAULT '0000-00-00 00:00:00' COMMENT '수정일시'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 테이블의 덤프 데이터 `g5_1_data`
--

INSERT INTO `g5_1_data` (`dta_idx`, `com_idx`, `imp_idx`, `mms_idx`, `shf_idx`, `cod_idx`, `dta_shf_no`, `dta_shf_max`, `dta_code`, `dta_group`, `dta_type`, `dta_no`, `dta_name`, `dta_dt`, `dta_value`, `dta_unit`, `dta_message`, `dta_status`, `dta_reg_dt`, `dta_update_dt`) VALUES
(20404809, 9999, 1, 0, 0, 0, 0, 0, 'M4012', 'err', '', 0, '', '2020-04-08 12:12:48', 0, '', '[M4012]', 'ok', '2020-04-08 12:12:48', '0000-00-00 00:00:00'),
(20404808, 9999, 1, 0, 0, 0, 0, 0, 'M4002', 'err', '', 0, '', '2020-04-08 12:12:47', 0, '', '[M4002] PLC Battery ', 'ok', '2020-04-08 12:12:48', '0000-00-00 00:00:00'),
(20404807, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:12:44', 1, '', '', 'ok', '2020-04-08 12:12:45', '0000-00-00 00:00:00'),
(20404806, 9999, 1, 0, 0, 0, 0, 0, 'M4004', 'err', '', 0, '', '2020-04-08 12:12:24', 0, '', '[M4004] PLC 고속링크2 이상', 'ok', '2020-04-08 12:12:25', '0000-00-00 00:00:00'),
(20404805, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:12:21', 1, '', '', 'ok', '2020-04-08 12:12:22', '0000-00-00 00:00:00'),
(20404804, 9999, 1, 0, 0, 0, 0, 0, 'M4006', 'err', '', 0, '', '2020-04-08 12:12:00', 0, '', '[M4006]', 'ok', '2020-04-08 12:12:01', '0000-00-00 00:00:00'),
(20404803, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:11:57', 1, '', '', 'ok', '2020-04-08 12:11:58', '0000-00-00 00:00:00'),
(20404802, 9999, 1, 0, 0, 0, 0, 0, 'M4012', 'err', '', 0, '', '2020-04-08 12:11:38', 0, '', '[M4012]', 'ok', '2020-04-08 12:11:39', '0000-00-00 00:00:00'),
(20404801, 9999, 1, 0, 0, 0, 0, 0, 'M4002', 'err', '', 0, '', '2020-04-08 12:11:38', 0, '', '[M4002] PLC Battery ', 'ok', '2020-04-08 12:11:39', '0000-00-00 00:00:00'),
(20404800, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:11:35', 1, '', '', 'ok', '2020-04-08 12:11:36', '0000-00-00 00:00:00'),
(20404799, 9999, 1, 0, 0, 0, 0, 0, 'M4004', 'err', '', 0, '', '2020-04-08 12:11:14', 0, '', '[M4004] PLC 고속링크2 이상', 'ok', '2020-04-08 12:11:15', '0000-00-00 00:00:00'),
(20404798, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:11:11', 1, '', '', 'ok', '2020-04-08 12:11:12', '0000-00-00 00:00:00'),
(20404797, 9999, 1, 0, 0, 0, 0, 0, 'M4006', 'err', '', 0, '', '2020-04-08 12:10:51', 0, '', '[M4006]', 'ok', '2020-04-08 12:10:52', '0000-00-00 00:00:00'),
(20404796, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:10:48', 1, '', '', 'ok', '2020-04-08 12:10:49', '0000-00-00 00:00:00'),
(20404795, 9999, 1, 0, 0, 0, 0, 0, 'M4012', 'err', '', 0, '', '2020-04-08 12:10:28', 0, '', '[M4012]', 'ok', '2020-04-08 12:10:29', '0000-00-00 00:00:00'),
(20404794, 9999, 1, 0, 0, 0, 0, 0, 'M4002', 'err', '', 0, '', '2020-04-08 12:10:28', 0, '', '[M4002] PLC Battery ', 'ok', '2020-04-08 12:10:29', '0000-00-00 00:00:00'),
(20404793, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:10:26', 1, '', '', 'ok', '2020-04-08 12:10:27', '0000-00-00 00:00:00'),
(20404792, 9999, 1, 0, 0, 0, 0, 0, 'M4004', 'err', '', 0, '', '2020-04-08 12:10:05', 0, '', '[M4004] PLC 고속링크2 이상', 'ok', '2020-04-08 12:10:06', '0000-00-00 00:00:00'),
(20404791, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:10:02', 1, '', '', 'ok', '2020-04-08 12:10:03', '0000-00-00 00:00:00'),
(20404790, 9999, 1, 0, 0, 0, 0, 0, 'M4006', 'err', '', 0, '', '2020-04-08 12:09:43', 0, '', '[M4006]', 'ok', '2020-04-08 12:09:44', '0000-00-00 00:00:00'),
(20404789, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:09:39', 1, '', '', 'ok', '2020-04-08 12:09:40', '0000-00-00 00:00:00'),
(20404788, 9999, 1, 0, 0, 0, 0, 0, 'M4012', 'err', '', 0, '', '2020-04-08 12:09:19', 0, '', '[M4012]', 'ok', '2020-04-08 12:09:20', '0000-00-00 00:00:00'),
(20404787, 9999, 1, 0, 0, 0, 0, 0, 'M4004', 'err', '', 0, '', '2020-04-08 12:09:19', 0, '', '[M4004] PLC 고속링크2 이상', 'ok', '2020-04-08 12:09:20', '0000-00-00 00:00:00'),
(20404786, 9999, 1, 0, 0, 0, 0, 0, 'M4002', 'err', '', 0, '', '2020-04-08 12:09:19', 0, '', '[M4002] PLC Battery ', 'ok', '2020-04-08 12:09:20', '0000-00-00 00:00:00'),
(20404785, 9999, 1, 0, 0, 0, 0, 0, '', 'product', '', 0, '', '2020-04-08 12:09:16', 1, '', '', 'ok', '2020-04-08 12:09:17', '0000-00-00 00:00:00');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `g5_1_data`
--
ALTER TABLE `g5_1_data`
  ADD PRIMARY KEY (`dta_idx`),
  ADD KEY `idx_dat_dt` (`dta_dt`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `g5_1_data`
--
ALTER TABLE `g5_1_data`
  MODIFY `dta_idx` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20404814;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
