INSERT INTO `g5_1_company` (`com_idx`, `com_idx_par`, `com_code`, `com_name`, `com_names`, `com_homepage`, `com_tel`, `com_fax`, `com_email`, `com_level`, `com_type`, `com_president`, `com_biz_no`, `com_biz_type1`, `com_biz_type2`, `com_zip1`, `com_zip2`, `com_addr1`, `com_addr2`, `com_addr3`, `com_addr_jibeon`, `com_send_type`, `com_memo`, `com_keys`, `com_kosmolog_key`, `com_status`, `com_reg_dt`, `com_update_dt`) VALUES
(31, 0, '', '한국수지', ', 한국수지(21-11-09~)', '', '054-775-4589', '', 'korsuji@naver.com', 6, 'etc', '김집수', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:22:00', '2021-11-09 20:22:00')
,(32, 31, '', '대한화성산업(주)', ', 대한화성산업(주)(21-11-09~)', '', '054-1111-1111', '', 'deahanwhasung@deahan.com', 2, 'purchase', '김대한', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:47:57', '2021-11-09 20:47:57')
,(33, 31, '', '조양세미켐(주)', ', 조양세미켐(주)(21-11-09~)', '', '054-2222-2222', '', 'joyangsemi@joyang.com', 2, 'purchase', '김조양', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:49:35', '2021-11-09 20:49:35')
,(34, 31, '', '(주)케이시플라스틱-안강', ', (주)케이시플라스틱-안강(21-11-09~)', '', '054-3333-3333', '', 'keisi@keisi.com', 2, 'purchase', '김케이시', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:50:58', '2021-11-09 20:50:58')
,(35, 31, '', '(주)코리아이노테크', ', (주)코리아이노테크(21-11-09~)', '', '054-5555-5555', '', 'koreaenotech@koreaenotech.com', 2, 'delivery', '김코리', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:52:33', '2021-11-09 20:52:33')
,(36, 31, '', '금강기업(주)', ', 금강기업(주)(21-11-09~)', '', '054-6666-6666', '', 'geumgang@geumgang.com', 2, 'delivery', '김금강', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:53:57', '2021-11-09 20:53:57')
,(37, 31, '', '(주)태경산업', ', (주)태경산업(21-11-09~)', '', '054-7777-7777', '', 'tegyeng@tegyeng.com', 2, 'delivery', '김태경', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:55:04', '2021-11-09 20:55:04')

,(37, 31, '', '(주)다우상상', ', (주)다우상사(21-11-09~)', '', '054-8888-7777', '', 'dawoo@dawoo.com', 2, 'delivery', '김다우', '', '', '', '', '', '', '', '', '', '', '', '', '', 'ok', '2021-11-09 20:55:04', '2021-11-09 20:55:04')

;
